Revit 2027 API
BuiltInFailures.ElectricalFailures.CannotRemoveMembersInCircuitHavingParent Property
 You have selected elements that are connected to a Panel object in a Circuit. These elements cannot be removed from the Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotRemoveMembersInCircuitHavingParent { get; }
Public Shared ReadOnly Property CannotRemoveMembersInCircuitHavingParent As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotRemoveMembersInCircuitHavingParent {
	FailureDefinitionId^ get ();
}
static member CannotRemoveMembersInCircuitHavingParent : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace